app/views/questions/index.html.haml

SELECT "questions".* FROM "questions" WHERE "questions"."subcategory_id" = $1  [["subcategory_id", 0]]
---
                          %tdescription
                            - subcategory.questions.order('id ASC').each do |question|