app/views/formulae/index.html.haml

                      -if index==0
                        \= &nbsp( &nbsp#{subcategory.description} &nbsp* &nbsp#{subcategory.weight}
                      -elsif index == category.subcategories.length-1
                        &nbsp + &nbsp#{subcategory.description} &nbsp* &nbsp#{subcategory.weight}&nbsp)&nbsp #{"/"} #{category.weight_sum}
---
SELECT "subcategories".* FROM "subcategories"

                      %thead
                        - subcategory.questions.order('id ASC').each_with_index do |question,index|
---
SELECT "questions".* FROM "questions" WHERE "questions"."subcategory_id" = $1  [["subcategory_id", 1]]