app/controllers/formulae_controller.rb

SELECT "subcategories".* FROM "subcategories"
---
    def index
        @home_nav_class = ''
        @input_nav_class = '' # Input Tab
        @formulae_nav_class = 'active'
        @output_nav_class = ''

        @subcategories = Subcategory.all