app/controllers/questions_controller.rb

  def show
    id = params[:id] # retrieve question ID from URI route
    @question = Question.find(id) # look up question by unique ID
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 7]]

  def index
    @home_nav_class = ''
    @input_nav_class = 'active' # Input Tab
    @formulae_nav_class = ''
    @output_nav_class = ''

    @categories = {0 => 'Business', 1 => 'Security', 2 => 'Finance'}

    sort = params[:sort] || session[:sort]
    case sort
    when 'keyword'
      ordering,@keyword_header = {:keyword => :asc}, 'hilite'
    when 'weight'
      ordering,@weight_header = {:weight => :desc}, 'hilite'
    end


    if params[:sort] != session[:sort] or params[:ratings] != session[:ratings]
      session[:sort] = sort
      session[:ratings] = @selected_ratings
      redirect_to :sort => sort, :ratings => @selected_ratings and return
    end

    @category_questions = []
    @categories.each do |q_cat|
      @category_questions[q_cat[0]] = Question.where(category_id: q_cat[0])
---
SELECT "questions".* FROM "questions" WHERE "questions"."category_id" = $1  [["category_id", 1]]

  def create
    @question = Question.create!(question_params)
---
INSERT INTO "questions" ("keyword", "index", "weight", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["keyword", "Personel"], ["index", 2], ["weight", 1.5], ["description", "Example Question"], ["created_at", "2018-10-22 06:30:20.556858"], ["updated_at", "2018-10-22 06:30:20.556858"]]

  def edit
    @question = Question.find params[:id]
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]

  def update
    @question = Question.find params[:id]
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", 1]]